package com.cjy.jackmusic.utils;

import java.util.List;

public class SearchUtil {


    /**
     * code : 200
     * message : 成功!
     * result : [{"author":"玄觞","link":"http://music.163.com/#/song?id=497527639","pic":"http://p2.music.126.net/U46rDgmdN6JYhltD1Cow2w==/109951162999576535.jpg?param=300x300","type":"netease","title":"九张机（Cover 叶炫清）","lrc":"[by:o不良人o]\n[00:00.00] 作曲 : 周琦\n[00:01.00] 作词 : 张富贵\n[00:11.560]混缩：Mr.鱼\n[00:14.560]光阴如梭\n[00:15.420]一梭才去一梭痴\n[00:20.980]情丝百转\n[00:21.920]丝丝缠乱犹不知\n[00:26.780]织一段 锦绣纹饰\n[00:30.960]并连理双枝\n[00:34.230]难寄托 这相思\n[00:40.820]兜兜转转\n[00:41.710]朝花夕拾却已迟\n[00:47.330]寻寻觅觅\n[00:48.160]醉生梦死又一世\n[00:53.260]还记得 前生盟誓\n[00:57.210]欲言竟无词\n[01:00.480]恨对面 不相识\n[01:05.780]我愿化作 望断天涯\n[01:10.380]那一方青石\n[01:12.950]篆刻心头 是你的名字\n[01:19.440]轮回彩蝶 化茧自缚\n[01:23.530]织就春蚕丝\n[01:25.930]剪不断 共缠绵\n[01:28.770]生生世世\n[01:59.680]兜兜转转\n[02:00.680]朝花夕拾却已迟\n[02:06.230]寻寻觅觅\n[02:07.010]醉生梦死又一世\n[02:12.070]还记得 前生盟誓\n[02:16.070]欲言竟无词\n[02:19.460]恨对面 不相识\n[02:25.200]我愿化作 望断天涯\n[02:29.070]那一方青石\n[02:31.810]篆刻心头 是你的名字\n[02:38.120]轮回彩蝶 化茧自缚\n[02:42.370]织就春蚕丝\n[02:44.870]剪不断 共缠绵\n[02:48.100]生生世世\n[02:51.540]我愿化作 望断天涯\n[02:55.540]那一方青石\n[02:57.960]篆刻心头 是你的名字\n[03:04.270]轮回彩蝶 化茧自缚\n[03:08.540]织就春蚕丝\n[03:10.920]剪不断 共缠绵\n[03:14.200]生生世世\n[03:17.720]剪不断 共缠绵\n[03:21.020]生生世世\n","songid":497527639,"url":"http://music.163.com/song/media/outer/url?id=497527639.mp3"},{"author":"夏璃夜","link":"http://music.163.com/#/song?id=504779976","pic":"http://p2.music.126.net/x-MHpxq7_ZEgvh5-MjMlwg==/109951163021351142.jpg?param=300x300","type":"netease","title":"从前慢（Cover 叶炫清）","lrc":"[by:逆光之处都是暖伤i_]\n[00:00.00] 作曲 : 刘胡轶\n[00:01.00] 作词 : 木心\n[00:25.07]记得早先少年时\n[00:30.96]大家诚诚恳恳\n[00:35.40]说一句 是一句\n[00:42.89]清早上火车站\n[00:48.27]长街黑暗无行人\n[00:52.45]卖豆浆的小店冒着热气\n[00:59.90]从前的日色变得慢\n[01:05.23]车，马，邮件都慢\n[01:09.37]一生只够爱一个人\n[01:17.21]从前的锁也好看\n[01:22.35]钥匙精美有样子\n[01:26.55]你锁了 人家就懂了\n[01:34.18]从前的日色变得慢\n[01:39.23]车，马，邮件都慢\n[01:43.58]一生只够爱一个人\n[01:51.11]从前的锁也好看\n[01:56.16]钥匙精美有样子\n[02:00.65]你锁了 人家就懂了\n","songid":504779976,"url":"http://music.163.com/song/media/outer/url?id=504779976.mp3"},{"author":"鹿雅","link":"http://music.163.com/#/song?id=532815145","pic":"http://p2.music.126.net/CRUlNTCOLcuSzsraR4FO8A==/109951162996160249.jpg?param=300x300","type":"netease","title":"风一样的我（Cover 叶炫清）","lrc":"[by:Give-G]\n[ti:]\n[ar:]\n[al:]\n[by:九九Lrc歌词网～www.99Lrc.net]\n[00:00.00] 作曲 : 周琦\n[00:01.00] 作词 : 周琦\n[00:28.60]我听见海的声音很温柔\n[00:36.09]藏在回忆的懵懂变得清澈\n[00:42.40]为何所有不快乐都给了我\n[00:49.23]一个人 吹着风\n[00:56.77]天色 慢慢暗了\n[00:59.87]回忆 开始疯了\n[01:03.45]月光 为谁变柔和\n[01:10.81]黑夜 辗转反侧\n[01:14.19]天亮 双眼朦胧\n[01:17.63]身体 为谁而掏空\n[01:23.86]风一样的我\n[01:26.49]被放逐到尽头\n[01:31.31]抓不住的梦\n[01:33.98]就任由它散落\n[01:38.56]狂妄的自我\n[01:40.51]原来才是你深藏的风格\n[01:45.40]让我逃离你无底线的掌控\n[01:56.78]\n[02:21.53]天色 慢慢暗了\n[02:24.98]回忆 开始疯了\n[02:28.39]月光 为谁变柔和\n[02:35.64]黑夜 辗转反侧\n[02:39.50]天亮 双眼朦胧\n[02:42.60]身体 为谁而掏空\n[02:48.78]风一样的我\n[02:51.17]被放逐到尽头\n[02:55.55]抓不住的梦\n[02:58.09]就任由它散落\n[03:02.72]狂妄的自我\n[03:05.18]原来才是你深藏的风格\n[03:09.64]让我逃离你无底线的掌控\n[03:16.79]风一样的我\n[03:19.12]拖着回忆行走\n[03:23.73]穿越了银河\n[03:26.37]找一个新宇宙\n[03:30.83]放肆的荒漠\n[03:33.31]原来才是你要去的自由\n[03:37.92]让我坠落让我沉没放你走\n[03:44.92]让我坠落让我沉没放你走\n","songid":532815145,"url":"http://music.163.com/song/media/outer/url?id=532815145.mp3"},{"author":"王梓钰","link":"http://music.163.com/#/song?id=497107195","pic":"http://p2.music.126.net/VBAQEJs0vId0AHBXrBqrQg==/109951162998372295.jpg?param=300x300","type":"netease","title":"九张机（《双世宠妃》主题曲）（Cover 叶炫清）","lrc":"[by:一梦南柯柯柯]\n[00:00.00] 作曲 : 周琦\n[00:00.355] 作词 : 张富贵\n[00:01.66]编曲：周琦\n[00:02.76]缩混：王路遥\n[00:03.87]笛子：叶炫清\n[00:04.97]吉他：周琦\n[00:05.80]\n[00:14.84]光阴如梭\n[00:15.72]一梭才去一梭痴\n[00:18.68]\n[00:21.18]情丝百转\n[00:22.13]丝丝缠乱犹不知\n[00:25.37]\n[00:26.97]织一段 锦绣纹饰\n[00:30.45]\n[00:30.95]并连理双枝\n[00:33.99]难寄托 这相思\n[00:38.41]\n[00:41.04]兜兜转转\n[00:42.03]朝花夕拾却已迟\n[00:45.10]\n[00:47.52]寻寻觅觅\n[00:48.45]醉生梦死又一世\n[00:51.78]\n[00:53.51]还记得 前生盟誓\n[00:57.01]欲言竟无词\n[00:59.97]\n[01:00.68]恨对面 不相识\n[01:05.24]\n[01:06.52]我愿化作 望断天涯\n[01:10.56]那一方青石\n[01:12.98]篆刻心头 是你的名字\n[01:18.89]\n[01:19.63]轮回彩蝶 化茧自缚\n[01:23.68]织就春蚕丝\n[01:26.41]剪不断 共缠绵\n[01:29.33]生生世世\n[01:32.48]\n[02:00.08]兜兜转转\n[02:00.95]朝花夕拾却已迟\n[02:04.05]\n[02:06.41]寻寻觅觅\n[02:07.33]醉生梦死又一世\n[02:10.74]\n[02:12.27]还记得 前生盟誓\n[02:16.18]欲言竟无词\n[02:19.24]恨对面 不相识\n[02:24.55]\n[02:25.30]我愿化作 望断天涯\n[02:29.42]那一方青石\n[02:31.80]篆刻心头 是你的名字\n[02:37.76]\n[02:38.47]轮回彩蝶 化茧自缚\n[02:42.55]织就春蚕丝\n[02:45.04]剪不断 共缠绵\n[02:48.26]生生世世\n[02:50.98]\n[02:51.69]我愿化作 望断天涯\n[02:55.74]那一方青石\n[02:58.14]篆刻心头 是你的名字\n[03:04.85]轮回彩蝶 化茧自缚\n[03:09.01]织就春蚕丝\n[03:11.21]剪不断 共缠绵\n[03:14.54]生生世世\n[03:17.92]剪不断 共缠绵\n[03:21.12]生生世世\n","songid":497107195,"url":"http://music.163.com/song/media/outer/url?id=497107195.mp3"},{"author":"觉醒之心（Awakening Conscience）","link":"http://music.163.com/#/song?id=503338609","pic":"http://p2.music.126.net/pzm9-WzfDsS4UQI9X1ZarA==/109951163017090632.jpg?param=300x300","type":"netease","title":"叶炫清 - 九张机-双世宠妃","lrc":"","songid":503338609,"url":"http://music.163.com/song/media/outer/url?id=503338609.mp3"},{"author":"Rosa","link":"http://music.163.com/#/song?id=506177917","pic":"http://p2.music.126.net/Vmn4zSu02LtrX_zyipCyrQ==/109951163025345399.jpg?param=300x300","type":"netease","title":"想自由（Cover 叶炫清）","lrc":"想自由 \n原唱：林宥嘉 \n作词：姚若龙 \n作曲：郑楠 \n----------------------\n翻唱：Rosa\n----------------------\n每个人都缺乏什么 \n我们才会瞬间就不快乐 \n单纯很难包袱很多 \n已经很勇敢还是难过 \n许多事情都有选择 \n只是往往事后我才懂得 \n情绪很烦说话很冲 \n人和人的沟通 \n有时候没有用 \n或许只有你懂得我 \n所以你没逃脱 \n一边在泪流一边紧抱我 \n小声地说多么爱我 \n只有你懂得我 \n就像被困住的野兽 \n在摩天大楼渴求自由 \n就算爱也会变冷的 \n可是现在抱的你是暖的 \n我不晓得我不舍得 \n为将来的难测就放弃这一刻 \n或许只有你懂得我 \n所以你没逃脱 \n一边在泪流一边紧抱我 \n小声地说多么爱我 \n只有你懂得我 \n就像被困住的野兽 \n在摩天大楼渴求自由 \n或许只有你懂得我 \n所以你没逃脱 \n一边在泪流一边紧抱我 \n小声地说多么爱我 \n只有你懂得我 \n就像被困住的野兽 \n在摩天大楼渴求自由 \n在摩天大楼渴求自由\n","songid":506177917,"url":"http://music.163.com/song/media/outer/url?id=506177917.mp3"},{"author":"Rosa","link":"http://music.163.com/#/song?id=494823665","pic":"http://p2.music.126.net/RhY0q8QbT8wwB-DNKKOzzA==/109951162991055565.jpg?param=300x300","type":"netease","title":"风一样的我（Cover 叶炫清）","lrc":"[00:00.00]风一样的我\n[00:00.01]\n[00:00.02]作词：周琦\n[00:00.03]作曲：周琦\n[00:00.04]原唱：叶炫清\n[00:00.05]Cover by Rosa\n[00:29.48]我听见海的声音很温柔\n[00:36.24]藏在回忆的懵懂变得清澈\n[00:43.56]为何所有不快乐都给了我\n[00:50.86]一个人 吹着风\n[00:57.10]天色 慢慢暗了\n[01:00.57]回忆 开始疯了\n[01:04.07]月光 为谁变柔和\n[01:11.17]黑夜 辗转反侧\n[01:14.72]天亮 双眼朦胧\n[01:18.25]身体 为谁而掏空\n[01:24.28]风一样的我\n[01:26.93]被放逐到尽头\n[01:31.47]抓不住的梦\n[01:33.93]就任由它散落\n[01:38.60]狂妄的自我\n[01:41.02]原来才是你深藏的风格\n[01:45.77]让我逃离你无底线的掌控\n[02:21.78]天色 慢慢暗了\n[02:25.22]回忆 开始疯了\n[02:28.77]月光 为谁变柔和\n[02:36.12]黑夜 辗转反侧\n[02:39.34]天亮 双眼朦胧\n[02:42.93]身体 为谁而掏空\n[02:49.06]风一样的我\n[02:51.56]被放逐到尽头\n[02:56.12]抓不住的梦\n[02:58.58]就任由它散落\n[03:03.19]狂妄的自我\n[03:05.71]原来才是你深藏的风格\n[03:10.22]让我逃离你无底线的掌控\n[03:17.49]风一样的我\n[03:19.86]拖着回忆行走\n[03:24.39]穿越了银河\n[03:26.76]找一个新宇宙\n[03:31.40]放肆的荒漠\n[03:33.84]原来才是你要去的自由\n[03:38.44]让我坠落让我沉没放你走\n[03:45.79]让我坠落让我沉没放你走\n","songid":494823665,"url":"http://music.163.com/song/media/outer/url?id=494823665.mp3"},{"author":"锦零","link":"http://music.163.com/#/song?id=493847338","pic":"http://p2.music.126.net/g2boQUop_8atyU2sVWd0Bw==/109951163319671215.jpg?param=300x300","type":"netease","title":"九张机（Cover 叶炫清）","lrc":"[00:00.00] 作曲 : 周琦\n[00:01.00] 作词 : 张富贵\n[00:10.38]翻唱：锦零\n[00:14.28]光阴如梭 一梭才去一梭痴\n[00:20.53]情丝百转 丝丝缠乱犹不知\n[00:26.60]织一段 锦绣纹饰\n[00:30.34]并连理双枝\n[00:33.50]难寄托\n[00:36.19]这相思\n[00:40.53]兜兜转转 朝花夕拾却已迟\n[00:46.67]寻寻觅觅 醉生梦死又一世\n[00:52.83]还记得 前生盟誓\n[00:57.00]欲言竟无词\n[01:00.00]恨对面 不相识\n[01:06.00]我愿化作 望断天涯\n[01:10.11]那一方青石\n[01:12.55]篆刻心头\n[01:14.87]是你的名字\n[01:18.87]轮回彩蝶 化茧自缚\n[01:23.25]织就春蚕丝\n[01:25.67]剪不断 共缠绵 生生世世\n[01:58.99]兜兜转转 朝花夕拾却已迟\n[02:06.04]寻寻觅觅 醉生梦死又一世\n[02:11.70]还记得 前生盟誓\n[02:15.60]欲言竟无词\n[02:18.92]恨对面 不相识\n[02:25.00]我愿化作 望断天涯\n[02:29.03]那一方青石\n[02:31.38]篆刻心头 是你的名字\n[02:37.97]轮回彩蝶 化茧自缚\n[02:42.03]织就春蚕丝\n[02:44.42]剪不断 共缠绵 生生世世\n[02:51.07]我愿化作 望断天涯\n[02:55.27]那一方青石\n[02:57.68]篆刻心头 是你的名字\n[03:04.01]轮回彩蝶 化茧自缚\n[03:08.40]织就春蚕丝\n[03:10.85]剪不断 共缠绵 生生世世\n[03:17.22]剪不断 共缠绵 生生世世\n","songid":493847338,"url":"http://music.163.com/song/media/outer/url?id=493847338.mp3"},{"author":"林心蕾","link":"http://music.163.com/#/song?id=539602180","pic":"http://p2.music.126.net/wWdr640qbwsY_EK3qHOhiw==/109951163096849200.jpg?param=300x300","type":"netease","title":"从前慢（Cover 叶炫清）","lrc":"[00:00.00] 作曲 : 无\n[00:01.00] 作词 : 无\n[00:27.000]记得早先少年时\n[00:33.000]大家诚诚恳恳\n[00:38.000]说一句是一句\n[00:45.000]清早上火车站\n[00:50.000]长街黑暗无行人\n[00:55.000]卖豆浆的小店冒着热气\n[01:02.000]从前的日色变得慢\n[01:07.000]车马邮件都慢\n[01:12.000]一生只够爱一个人\n[01:19.000]从前的锁也好看\n[01:25.000]钥匙精美有样子\n[01:29.000]你锁了\n[01:32.000]人家就懂了\n[01:53.000]从前的日色变得慢\n[01:59.000]车马邮件都慢\n[02:03.000]一生只够爱一个人\n[02:10.000]从前的锁也好看\n[02:16.000]钥匙精美有样子\n[02:20.000]你锁了\n[02:23.000]人家就懂了\n[02:27.000]从前的日色变得慢\n[02:33.000]车马邮件都慢\n[02:37.000]一生只够爱一个人\n[02:44.000]从前的锁也好看\n[02:50.000]钥匙精美有样子\n[02:54.000]你锁了\n[02:57.000]人家就懂了\n[03:06.000]记得早先少年时\n[03:13.000]大家诚诚恳恳\n[03:18.000]说一句\n[03:22.000]是一句\n","songid":539602180,"url":"http://music.163.com/song/media/outer/url?id=539602180.mp3"},{"author":"以冬","link":"http://music.163.com/#/song?id=515419735","pic":"http://p2.music.126.net/1BEEqCrI15UIE3zgL4m3jQ==/109951163050489150.jpg?param=300x300","type":"netease","title":"为爱诛仙（Cover 叶炫清）","lrc":"[ti:]\n[ar:]\n[al:]\n[00:00.00] 作曲 : 杜雯媞\n[00:01.00] 作词 : 李岩\n[00:04.97]为爱诛仙（诛仙3游戏主题曲）\n[00:09.81]作曲：杜雯媞\n[00:13.06]作词：李岩\n[00:16.33]原唱：叶炫清\n[00:18.32]翻唱：以冬\n[00:20.91]制作人：杜雯媞\n[00:22.81]编曲：余雷\n[00:23.95]混音：圣雨轻纱\n[00:24.95]视频：也珂\n[00:28.37]\n[00:29.23]岁月透过淡淡的微光\n[00:35.66]碎裂在你我的手掌\n[00:41.37]回望缱绻的时光 眷恋那么长\n[00:48.48]月光不思凉 思念在发烫\n[00:55.15]乘风沐雨段段的过往\n[01:01.58]天真无畏执手的模样\n[01:07.04]青春从不曾迷惘 和天地对抗\n[01:14.54]誓言未忘 你在我眼眶\n[01:23.42]\n[01:21.22]我回望几世的沧桑\n[01:29.17]宿命狂轮回的倔强\n[01:35.76]归来年少时 还念念不忘\n[01:42.34]一生只为你痴狂\n[01:48.62]我回望一身的风霜\n[01:55.23]山水长你教我坚强\n[02:01.81]红尘梦一场 才荡气回肠\n[02:08.83]在你转身的最远方\n[02:13.12]爱未央\n[02:30.72]乘风沐雨段段的过往\n[02:37.28]天真无畏执手的模样\n[02:42.82]青春从不曾迷惘 和天地对抗\n[02:50.37]誓言未忘 你在我眼眶\n[02:58.52]我回望几世的沧桑\n[03:04.94]宿命狂轮回的倔强\n[03:11.43]归来年少时 还念念不忘\n[03:18.28]一生只为你痴狂\n[03:24.51]我回望一身的风霜\n[03:31.21]山水长你教我坚强\n[03:37.29]红尘梦一场 才荡气回肠\n[03:44.08]在你转身的最远方\n[03:48.52]爱未央\n","songid":515419735,"url":"http://music.163.com/song/media/outer/url?id=515419735.mp3"}]
     */

    private int code;
    private String message;
    private List<ResultBean> result;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public String getMessage() {
        return message;
    }

    public void setMessage(String message) {
        this.message = message;
    }

    public List<ResultBean> getResult() {
        return result;
    }

    public void setResult(List<ResultBean> result) {
        this.result = result;
    }

    public static class ResultBean {
        /**
         * author : 玄觞
         * link : http://music.163.com/#/song?id=497527639
         * pic : http://p2.music.126.net/U46rDgmdN6JYhltD1Cow2w==/109951162999576535.jpg?param=300x300
         * type : netease
         * title : 九张机（Cover 叶炫清）
         * lrc : [by:o不良人o]
         [00:00.00] 作曲 : 周琦
         [00:01.00] 作词 : 张富贵
         [00:11.560]混缩：Mr.鱼
         [00:14.560]光阴如梭
         [00:15.420]一梭才去一梭痴
         [00:20.980]情丝百转
         [00:21.920]丝丝缠乱犹不知
         [00:26.780]织一段 锦绣纹饰
         [00:30.960]并连理双枝
         [00:34.230]难寄托 这相思
         [00:40.820]兜兜转转
         [00:41.710]朝花夕拾却已迟
         [00:47.330]寻寻觅觅
         [00:48.160]醉生梦死又一世
         [00:53.260]还记得 前生盟誓
         [00:57.210]欲言竟无词
         [01:00.480]恨对面 不相识
         [01:05.780]我愿化作 望断天涯
         [01:10.380]那一方青石
         [01:12.950]篆刻心头 是你的名字
         [01:19.440]轮回彩蝶 化茧自缚
         [01:23.530]织就春蚕丝
         [01:25.930]剪不断 共缠绵
         [01:28.770]生生世世
         [01:59.680]兜兜转转
         [02:00.680]朝花夕拾却已迟
         [02:06.230]寻寻觅觅
         [02:07.010]醉生梦死又一世
         [02:12.070]还记得 前生盟誓
         [02:16.070]欲言竟无词
         [02:19.460]恨对面 不相识
         [02:25.200]我愿化作 望断天涯
         [02:29.070]那一方青石
         [02:31.810]篆刻心头 是你的名字
         [02:38.120]轮回彩蝶 化茧自缚
         [02:42.370]织就春蚕丝
         [02:44.870]剪不断 共缠绵
         [02:48.100]生生世世
         [02:51.540]我愿化作 望断天涯
         [02:55.540]那一方青石
         [02:57.960]篆刻心头 是你的名字
         [03:04.270]轮回彩蝶 化茧自缚
         [03:08.540]织就春蚕丝
         [03:10.920]剪不断 共缠绵
         [03:14.200]生生世世
         [03:17.720]剪不断 共缠绵
         [03:21.020]生生世世

         * songid : 497527639
         * url : http://music.163.com/song/media/outer/url?id=497527639.mp3
         */

        private String author;
        private String link;
        private String pic;
        private String type;
        private String title;
        private String lrc;
        private int songid;
        private String url;

        public String getAuthor() {
            return author;
        }

        public void setAuthor(String author) {
            this.author = author;
        }

        public String getLink() {
            return link;
        }

        public void setLink(String link) {
            this.link = link;
        }

        public String getPic() {
            return pic;
        }

        public void setPic(String pic) {
            this.pic = pic;
        }

        public String getType() {
            return type;
        }

        public void setType(String type) {
            this.type = type;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getLrc() {
            return lrc;
        }

        public void setLrc(String lrc) {
            this.lrc = lrc;
        }

        public int getSongid() {
            return songid;
        }

        public void setSongid(int songid) {
            this.songid = songid;
        }

        public String getUrl() {
            return url;
        }

        public void setUrl(String url) {
            this.url = url;
        }
    }
}